Repository: animesh/catala
Catalog: po/*.po
Languages: fr

source: $(i, OUTPUT) is the file that will contain the extracted output (for compiler backends)
fr: $(i, SORTIE) est le fichier qui contient la sortie du compilateur (pour n'importe quelle cible)

source: BACKEND
fr: CIBLE

source: Backend selection among: LaTeX, Makefile
fr: Cible du compilateur parmi: Latex, Makefile

source: Catala is a domain-specific language for deriving faithful-by-construction algorithms from legislative texts.
fr: Catala est un langage à domaine spécifique conçu pour annoter les textes législatifs avec un contenu algorithmique fidèle par construction

source: Catala master file to be compiled
fr: Fichier maître Catala à compiler

source: Compiler for Catala, a specification language for tax and social benefits computation rules.
fr: Compilateur pour Catala, un langage de spécification pour les règles de calcul socio-fiscales

source: Directory containing .mo translation files for the catala domain
fr: Dossier contenant les fichiers de traduction .mo pour le domaine "catala"

source: FILE
fr: FICHIER

source: Input language among: en, fr (default fr)
fr: Langage d'entrée parmi: en, fr (par défaut fr)

source: LANG
fr: LANGUE

source: LOCALEDIR
fr: DOSSIERLOCALES

source: Location of a custom pygmentize executable for LaTeX source code highlighting
fr: Emplacement d'un exécutable pygmentize personnalisé pour la coloration syntaxique sous LaTeX

source: OUTPUT
fr: SORTIE

source: Parsing %s
fr: Analyse syntaxique de %s

source: Parsing error %s on token "%s"
fr: Erreur de syntaxe %s sur le mot %s

source: Please file bug reports at https://gitlab.inria.fr/verifisc/catala/issues
fr: Merci d'envoyer vos rapports de bug à https://gitlab.inria.fr/verifisc/catala/issues

source: Prints debug information
fr: Affiche des informations de déboggage

source: Reading files twice...
fr: Lecture double des fichiers...

source: Reading files...
fr: Lecture des fichiers source...

source: Source file %s must have the .catala extension!
fr: Le fichier source %s doit avoir l'extension .catala !

source: Syntax error at token "%s" %s %s %s
fr: Erreur de syntaxe au mot "%s" %s %s %s

source: The selected backend (%s) is not supported by Catala
fr: La cible sélectionnée (%s) n'est pas supportée par Catala

source: The selected language (%s) is not supported by Catala
fr: Le langage sélectionné (%s) n'est pas supporté par Catala

source: Typical usage:
fr: Exemple typique d'utilisation

source: Weaving error: %s
fr: Erreur de tissage : %s

source: Weaving literate program into %s
fr: Tissage du programme dans %s

source: Wraps literate programming output with a minimal preamble
fr: Enveloppe la sortie littéraire du programme avec un préambule minimal

source: Writing to %s
fr: Écriture dans %s

source: [DEBUG]
fr: [DÉBOGGAGE]

source: [ERROR]
fr: [ERREUR]

source: [RESULT]
fr: [RÉSULTAT]

source: [WARNING]
fr: [ATTENTION]

source: in file %s, from %d:%d to %d:%d
fr: dans le fichier %s, depuis %d:%d jusqu'à %d:%d

source: on error.
fr: lors d'une erreur.
